biddr_api/app/controllers/api/v1/bids_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "bids" ("amount", "auction_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 355.0], ["auction_id", 5], ["created_at", "2020-06-24 19:49:46.163249"], ["updated_at", "2020-06-24 19:49:46.163249"], ["user_id", 5]]
---
    def create
      auction = Auction.find(params[:auction_id])
      bid = Bid.new bid_params
      bid.auction = auction
      bid.user = current_user
      bid.save!